#R - пила на нитке
#H - крюк
#s - пила (ставить на клетку выше чем нужно)
#l,L - двигающаяся платформа вверх вниз маленькая буква путь большая сам а платформа
#P,p - двигающаяся платформа вправо влево маленькая буква путь большая сам а платформа
#D - Дверь с замками
#Д - Дверь по кноке
#П - пружина
#K(руская) - шипи не двиг
#ш - шипи 
#K(английская) - ключ
#b - блок
#c - трескающаясь платформа
#Л - лесница середина   л - лесница начало    ъ - лесница конец    Ъ -   Лесница конец начало
#I - невидимая платформа

#Матрица для первой локации первого уровня
list_surface_lvl1_location_1 = [
                list('Л0000000000000000000'),
                list('ъ0000000000000000000'),
                list('bbb00000000000000000'),
                list('bbb00000000000bbЪ000'),
                list('bbb00ccc00Д000000000'),
                list('00000000000000000000'),
                list('00000000000s00000cc0'),
                list('0000000PPppppppp0000'),
                list('00bbb000000000000000'),
                list('000000000000000шшшшш'),
                list('bbbbbbbbbbbbbbbbbbbb'),
]
#Матрица для второй локации первого уровня
list_surface_lvl1_location_2 = [
                list('00000000000H00000000'),
                list('00000000000000000000'),
                list('00000000000000000000'),
                list('00000000000000000000'),
                list('00000cc0000000000bbb'),
                list('bbЪ00000000000000000'),
                list('00000000000000000000'),
                list('00000000000000000000'),
                list('000bb000000000000000'),
                list('00000000000000000000'),
                list('bbbbbbbbbbbbbbbbbbbb'),
]
#Матрица для третий локации первого уровня
list_surface_lvl1_location_3 = [
                list('000000b0000000000000'),
                list('000000b0000000000000'),
                list('000000b00000000000bb'),
                list('000000b0000c00000000'),
                list('bb0L00bbЪ00000000000'),
                list('000l00b000000000П000'),
                list('000l00b000000000b000'),
                list('000l00b0000000000000'),
                list('000l000000c000000000'),
                list('00000000000000000000'),
                list('bbbbbbbbbbbbbbbbbbbb'),
]
#Матрица для четвертой локации первого уровня
list_surface_lvl1_location_4 = [
                list('000000000000000000R0'),
                list('00000000000000000000'),
                list('0000PPpppppb00000000'),
                list('bb000000000b00000000'),
                list('000cc000000b00000000'),
                list('00000000000bcc000000'),
                list('0000000cc00b00000лbb'),
                list('00000000000b00000Л00'),
                list('000bb000000b00000ъ00'),
                list('00000000000b00000000'),
                list('bbbbbbbbbbbbbbbbbbbb'),
]
#Список локаций первого уровня
list_surface_lvl1 = [list_surface_lvl1_location_1,list_surface_lvl1_location_2,list_surface_lvl1_location_3,list_surface_lvl1_location_4]

#Список уровней
list_surface = [list_surface_lvl1]